export default {
  title: {
    text: '折线图堆叠'
  },
  tooltip: {
    trigger: 'axis'
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '3%',
    containLabel: true
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  xAxis: {
    splitNumber: 5,
    data: ['周一周一周一周一', '周二周二周二周二周二', '周三', '周四', '周五', '周六', '周日', '周一', '周二', '周三', '周四', '周五', '周六', '周日', '周一', '周二', '周三', '周四', '周五', '周六', '周日', '周一', '周二', '周三', '周四', '周五', '周六', '周日']
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      name: '邮件营销',
      type: 'line',
      stack: '总量',
      showSymbol: false,
      data: [120, 212, 132, 101, 134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210]
    },
    {
      name: '邮件营销',
      type: 'line',
      stack: '总量',
      showSymbol: false,
      data: [134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210, 120, 212, 132, 101, 134, 90, 230, 210]
    }
  ]
};
